app/controllers/movies_controller.rb

  def index
    # Recuperamos el orden de filtrado por columna (filas o fecha)
    orden_filtrado_columnas = params[:ordenacion_seleccionada]

    if orden_filtrado_columnas == 'porTitulo'
      # Ordenacion por TITLE
      @movies = Movie.order('title ASC')

      # Modificación del estilo de la cabecera
      @clase_cabecera_titulo = 'hilite'
    elsif orden_filtrado_columnas == 'porFecha'
      # Ordenación por RELEASE_DATE
      @movies = Movie.order('release_date ASC')

      # Modificación del estilo de la cabecera
      @clase_cabecera_fecha = 'hilite'
    else
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title ASC
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies"